load-tests/config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Warm up phase - Gradually increase load"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load phase - Maintain moderate load"
    - duration: 60
      arrivalRate: 20
      rampTo: 50
      name: "Stress test phase - Ramp up to peak load"
    - duration: 30
      arrivalRate: 5
      name: "Cool down phase - Scale back to normal"
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # Define custom environment variables here
  # Note: For actual testing, use environment variables or CLI args
  variables:
    authCookie: "next-auth.session-token=REPLACE_WITH_ACTUAL_SESSION_TOKEN"

  # Enable response time metrics
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  # Health check test - No authentication required
  - name: "Health check API test"
    weight: 5
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "status"
            - equals:
                - "{{ status }}"
                - "healthy"

  # Authenticated API tests
  - name: "Authenticated API flows"
    weight: 3
    flow:
      # Set the authentication cookie for all requests in this flow
      - think: 1
      - function: "setAuthCookie"
      
      # Get user preferences
      - get:
          url: "/api/profile/preferences"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"

      # Update a single preference
      - think: 2
      - patch:
          url: "/api/profile/preferences"
          headers:
            Cookie: "{{ authCookie }}"
          json:
            theme: "dark"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "message"
            - hasProperty: "preferences"
            - equals:
                - "{{ preferences.theme }}"
                - "dark"
      
      # Get dashboard stats
      - think: 1
      - get:
          url: "/api/dashboard/stats"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "moodCount"
            - hasProperty: "likesReceived"
            - hasProperty: "commentsReceived"

  # Error handling tests
  - name: "Error handling tests"
    weight: 1
    flow:
      # Request with invalid method
      - post:
          url: "/api/health"
          expect:
            - statusCode: 405
      
      # Request with invalid data
      - function: "setAuthCookie"
      - patch:
          url: "/api/profile/preferences"
          headers:
            Cookie: "{{ authCookie }}"
          json:
            theme: "invalid-theme"
          expect:
            - statusCode: 400

functions:
  # Helper function to set auth cookie
  setAuthCookie:
    function: |
      function setAuthCookie(context, events, done) {
        // Auth cookie would normally be obtained through login process
        // For this test, we use the configured cookie
        context.vars.currentCookie = context.vars.authCookie;
        return done();
      }